git-nalewki2/app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.search(params[:search], params[:page])
---
SELECT "recipes".* FROM "recipes" WHERE (nazwa like '%%') ORDER BY nazwa LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "recipes" WHERE (nazwa like '%%')

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 1) LIMIT 1

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 12) LIMIT 1

  def create
    @recipe = Recipe.new(params[:recipe])
  if @recipe.save
---
INSERT INTO "recipes" ("przepis", "updated_at", "photo_content_type", "trudnosc", "skladniki", "photo_file_size", "photo_updated_at", "autor", "cena", "created_at", "photo_file_name", "nazwa") VALUES ('Miętę wypłukać,osuszyć i porwać na drobne kawałki. Wrzucić do słoja i zalać spirytusem. Macerować na zimno przez 2 dni lecz nie dłużej aby pożądana piękna zielona barwa nie zmieniła się w brąz. Wodę z cukrem i sokiem cytrynowym gotować, aż do uzyskania delikatnego syropu. Po wystudzeniu należy wlać syrop do słoja z macerowanymi składnikami i wymieszać aby połączyć spirytus z syropem. Przygotowaną nalewkę należy teraz przefiltrować i rozlać do butelek. Nasza nalewka powinna w tym momencie dojrzewać minimum 2 tygodnie. Jeżeli barwa nalewki jest dla nas bardziej istotna od jej walorów smakowych możemy nie dodawać soku z cytryny gdyż zawarty w nim kwasek zawsze zmienia barwę nalewki - w tym wypadku stanie się ona bardziej brązowo-seledynowa.', '2011-01-12 21:09:13.213248', 'image/jpeg', 0, '15 łodyżek świeżej mięty (razem z listkami), 80 dkg. cukru, sok z połowy cytryny, 1L spirytusu, 1,5L wody', 32848, '2011-01-12 21:09:13.159477', 'Miętowy', '120zł', '2011-01-12 21:09:13.213248', 'nalewka_z_mietki_kedzierzawej_przepis.jpg', 'Miętówka')

  def update
    @recipe = Recipe.find(params[:id])
  if @recipe.update_attributes(params[:recipe])
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 12) LIMIT 1
UPDATE "recipes" SET "cena" = '100 zł', "updated_at" = '2011-01-12 21:06:09.343483' WHERE ("recipes"."id" = 12)

  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 1) LIMIT 1
DELETE FROM "recipes" WHERE ("recipes"."id" = 1)

   def rate
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 12) LIMIT 1