git-nalewki2/app/views/recipes/index.html.erb

<script type="text/javascript" src="/javascripts/jquery.js"></script>
<script type="text/javascript" src="/javascripts/jquery.tagcloud.min.js"></script>
---
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN recipes ON recipes.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Recipe') AND (taggings.taggable_id IN(SELECT recipes.id FROM "recipes")) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

<p style="height:22px; width:100%;  padding:0px; margin:0px;">
<span style="padding:2px 2px 0px 5px; float:left;" >Liczba komentarzy: <b><%= recipe.comments.count %></b></span>
---
SELECT COUNT(*) FROM "comments" WHERE ("comments".recipe_id = 12)