app/controllers/comments_controller.rb

  def create
    @comment = @recipe.comments.new params[:comment]
    @comment.save
---
INSERT INTO "comments" ("author", "body", "created_at", "recipe_id", "updated_at") VALUES ('ty', 'tak jkest', '2011-01-11 19:05:06.531569', 9, '2011-01-11 19:05:06.531569')

  def destroy
    @comment = @recipe.comments.find params[:id]
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE ("comments".recipe_id = 11) AND ("comments"."id" = 5) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 5)